<a href="https://colab.research.google.com/github/GNuSeekK/ICTCOG/blob/main/2_12_%5Bpandas%5D_apply%2C_lambda.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
filepath="/content/drive/MyDrive/ICTCOG 인공지능과정/Data/korean-idol.csv"

df = pd.read_csv(filepath)
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928

# apply
Series, DataFrame에 **구체적인 로직**을 적용하고 싶을 때 활용
* 단순 집계 뿐이 아닌 각 데이터에 프로그래밍적인 효과
  * 데이터에 대한 조건검사를 한다거나
  * 형태소 분리도 가능
  * 복잡한 조건에 의한 데이터 편집 등등....
* apply는 정의한 로직함수를 인자로 넘긴다

In [4]:
# 남자 : 1, 여자는 0으로 설정하기
df2 = df.copy()

df2.loc[df['성별'] == '남자', '성별'] = 1
df2.loc[df['성별'] == '여자', '성별'] = 0

df2.head()

     이름     그룹  소속사 성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  1  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  1  1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  1  1996-12-10  180.0   A   8273745
3     뷔  방탄소년단  빅히트  1  1995-12-30  178.0  AB   8073501
4    화사    마마무  RBW  0  1995-07-23  162.1   A   7650928

apply를 사용

In [7]:
# 각 데이터에 적용시킬 함수가 필요하다 - 반드시 return값이 있어야 해요.
def male_or_female(x): # x에는 성별이 들어갈 것이다. ( 남자, 여자 )
  if x =='남자':
    return 1
  elif x == '여자':
    return 0
  else:
    return -1

In [8]:
df['성별_NEW'] = df['성별'].apply(male_or_female)
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수  성별_NEW
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260       1
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947       1
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745       1
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501       1
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928       0

## lambda 함수 적용하기
* lambda는 1줄로 작성하는 간단한 함수식
* return을 따로 명시하지는 않는다.

In [9]:
df['성별'].apply(lambda x : 1 if x == '남자' else 0)

0     1
1     1
2     1
3     1
4     0
5     1
6     1
7     0
8     1
9     1
10    0
11    1
12    1
13    1
14    1
Name: 성별, dtype: int64

**간단한 계산식을 적용하기 위해 사용**

In [10]:
df['키 / 2'] = df['키'].apply(lambda x : x / 2)
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수  성별_NEW  키 / 2
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260       1  86.80
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947       1  88.50
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745       1  90.00
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501       1  89.00
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928       0  81.05

# mapping
값을 입힌다는 개념. 입힐 값들을 딕셔너리 형태로 만들어 놓는다.

In [11]:
my_map = {
    '남자': 1,
    '여자': 0
}

df['성별'].map(my_map)

0     1
1     1
2     1
3     1
4     0
5     1
6     1
7     0
8     1
9     1
10    0
11    1
12    1
13    1
14    1
Name: 성별, dtype: int64

In [12]:
my_map = {
    '남자': 'male',
    '여자': 'female'
}

df['성별'].map(my_map)

0       male
1       male
2       male
3       male
4     female
5       male
6       male
7     female
8       male
9       male
10    female
11      male
12      male
13      male
14      male
Name: 성별, dtype: object